#pragma once

#ifdef _INC_WINAPIFAMILY
#	error Windows API detected. Please move any Windows API includes after CommonLibSF, or remove them.
#else

namespace SFSE::WinAPI
{
	// general constants
	inline const auto     INVALID_HANDLE_VALUE{ reinterpret_cast<void*>(static_cast<std::intptr_t>(-1)) };
	inline constexpr auto MAX_PATH{ 260u };

	// standard access
	inline constexpr auto STANDARD_RIGHTS_REQUIRED{ 0x000F0000 };
	inline constexpr auto STANDARD_RIGHTS_ALL{ 0x001F0000 };

	// code page identifiers
	inline constexpr auto CP_UTF8{ 65001u };

	// pe image header
	inline constexpr auto IMAGE_DOS_SIGNATURE{ 0x5A4Du };
	inline constexpr auto IMAGE_NT_SIGNATURE{ 0x00004550u };
	inline constexpr auto IMAGE_NT_OPTIONAL_HDR32_MAGIC{ 0x10Bu };
	inline constexpr auto IMAGE_NT_OPTIONAL_HDR64_MAGIC{ 0x20Bu };

	// pe image directory entries
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_EXPORT{ 0u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_IMPORT{ 1u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_RESOURCE{ 2u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_EXCEPTION{ 3u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_SECURITY{ 4u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_BASERELOC{ 5u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_DEBUG{ 6u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_ARCHITECTURE{ 7u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_GLOBALPTR{ 8u };
	inline constexpr auto IMAGE_DIRECTORY_ENTRY_TLS{ 9u };

	inline constexpr auto LCMAP_TITLECASE{ 0x00000300u };
	inline constexpr auto LCMAP_SORTKEY{ 0x00000400u };
	inline constexpr auto LCMAP_BYTEREV{ 0x00000800u };
	inline constexpr auto LCMAP_HIRAGANA{ 0x00100000u };
	inline constexpr auto LCMAP_KATAKANA{ 0x00200000u };
	inline constexpr auto LCMAP_HALFWIDTH{ 0x00400000u };
	inline constexpr auto LCMAP_FULLWIDTH{ 0x00800000u };
	inline constexpr auto LCMAP_LINGUISTIC_CASING{ 0x01000000u };
	inline constexpr auto LCMAP_SIMPLIFIED_CHINESE{ 0x02000000u };
	inline constexpr auto LCMAP_TRADITIONAL_CHINESE{ 0x04000000u };

	// locale names
	inline constexpr auto LOCALE_NAME_USER_DEFAULT{ nullptr };
	inline constexpr auto LOCALE_NAME_INVARIANT{ L"" };
	inline constexpr auto LOCALE_NAME_SYSTEM_DEFAULT{ L"!x-sys-default-locale" };

	// process creation flags
	inline constexpr auto DEBUG_PROCESS{ 0x00000001u };
	inline constexpr auto DEBUG_ONLY_THIS_PROCESS{ 0x00000002u };
	inline constexpr auto CREATE_SUSPENDED{ 0x00000004u };
	inline constexpr auto DETACHED_PROCESS{ 0x00000008u };
	inline constexpr auto CREATE_NEW_CONSOLE{ 0x00000010u };
	inline constexpr auto NORMAL_PRIORITY_CLASS{ 0x00000020u };
	inline constexpr auto IDLE_PRIORITY_CLASS{ 0x00000040u };
	inline constexpr auto HIGH_PRIORITY_CLASS{ 0x00000080u };
	inline constexpr auto REALTIME_PRIORITY_CLASS{ 0x00000100u };
	inline constexpr auto CREATE_NEW_PROCESS_GROUP{ 0x00000200u };
	inline constexpr auto CREATE_UNICODE_ENVIRONMENT{ 0x00000400u };
	inline constexpr auto CREATE_FORCEDOS{ 0x00002000u };
	inline constexpr auto BELOW_NORMAL_PRIORITY_CLASS{ 0x00004000u };
	inline constexpr auto ABOVE_NORMAL_PRIORITY_CLASS{ 0x00008000u };
	inline constexpr auto INHERIT_PARENT_AFFINITY{ 0x00010000u };
	inline constexpr auto CREATE_PROTECTED_PROCESS{ 0x00040000u };
	inline constexpr auto EXTENDED_STARTUPINFO_PRESENT{ 0x00080000u };
	inline constexpr auto PROCESS_MODE_BACKGROUND_BEGIN{ 0x00100000u };
	inline constexpr auto PROCESS_MODE_BACKGROUND_END{ 0x00200000u };
	inline constexpr auto CREATE_SECURE_PROCESS{ 0x00400000 };
	inline constexpr auto CREATE_BREAKAWAY_FROM_JOB{ 0x01000000u };
	inline constexpr auto CREATE_PRESERVE_CODE_AUTHZ_LEVEL{ 0x02000000u };
	inline constexpr auto CREATE_DEFAULT_ERROR_MODE{ 0x04000000u };
	inline constexpr auto CREATE_NO_WINDOW{ 0x08000000u };

	// symbol name undecoration flags
	inline constexpr auto UNDNAME_NO_MS_KEYWORDS{ 0x00000002u };
	inline constexpr auto UNDNAME_NO_FUNCTION_RETURNS{ 0x00000004u };
	inline constexpr auto UNDNAME_NO_ALLOCATION_MODEL{ 0x00000008u };
	inline constexpr auto UNDNAME_NO_ALLOCATION_LANGUAGE{ 0x00000010u };
	inline constexpr auto UNDNAME_NO_THISTYPE{ 0x00000060u };
	inline constexpr auto UNDNAME_NO_ACCESS_SPECIFIERS{ 0x00000080u };
	inline constexpr auto UNDNAME_NO_THROW_SIGNATURES{ 0x00000100u };
	inline constexpr auto UNDNAME_NO_RETURN_UDT_MODEL{ 0x00000400u };
	inline constexpr auto UNDNAME_NAME_ONLY{ 0x00001000u };
	inline constexpr auto UNDNAME_NO_ARGUMENTS{ 0x00002000u };

	using THREAD_START_ROUTINE = std::uint32_t(void* a_param);

	struct CRITICAL_SECTION
	{
	public:
		// members
		void*          debugInfo;       // 00
		std::int32_t   lockCount;       // 08
		std::int32_t   recursionCount;  // 0C
		void*          owningThread;    // 10
		void*          lockSemaphore;   // 18
		std::uint64_t* spinCount;       // 20
	};
	static_assert(sizeof(CRITICAL_SECTION) == 0x28);

	struct FILETIME
	{
		// members
		std::uint32_t lo;  // 00
		std::uint32_t hi;  // 04
	};
	static_assert(sizeof(FILETIME) == 0x8);

	struct GUID
	{
		std::uint32_t data1;
		std::uint16_t data2;
		std::uint16_t data3;
		std::uint8_t  data4[8];
	};
	static_assert(sizeof(GUID) == 0x10);

	// known folder ids
	inline constexpr GUID FOLDERID_DOCUMENTS{ 0xFDD39AD0u, 0x238Fu, 0x46AFu, 0xADu, 0xB4u, 0x6Cu, 0x85u, 0x48u, 0x03u, 0x69u, 0xC7u };
	inline constexpr GUID FOLDERID_PICTURES{ 0x33E28130u, 0x4E1Eu, 0x4676u, 0x83u, 0x5Au, 0x98u, 0x39u, 0x5Cu, 0x3Bu, 0xC3u, 0xBBu };
	inline constexpr GUID FOLDERID_PROGRAMDATA{ 0x62AB5D82u, 0xFDC1u, 0x4DC3u, 0xA9u, 0xDDu, 0x07u, 0x0Du, 0x1Du, 0x49u, 0x5Du, 0x97u };

	using HRESULT = std::uint32_t;

	struct HWND__;
	using HWND = HWND__*;

	struct HINSTANCE__;
	using HINSTANCE = HINSTANCE__*;
	using HMODULE = HINSTANCE;

	struct HKEY__;
	using HKEY = HKEY__*;

	inline auto HKEY_CLASSES_ROOT{ reinterpret_cast<HKEY>(0x80000000ull) };
	inline auto HKEY_CURRENT_USER{ reinterpret_cast<HKEY>(0x80000001ull) };
